       01 WS-REG-CLIENTE.
           05 WS-CLI-ID        PIC 9(05).
           05 WS-CLI-NOME      PIC X(30).
           05 WS-CLI-SALDO     PIC 9(09).