       01 WS-REG-IDX-CLI.
           05 IDX-CLI-ID       PIC 9(05).
           05 IDX-CLI-NOME     PIC X(30).
           05 IDX-CLI-SALDO    PIC 9(09).
           05 IDX-CLI-DTATU    PIC X(10).