       01 WS-REG-IDX-TRX.
           05 IDX-TRX-ID       PIC 9(05).
           05 IDX-TRX-CLI-ID   PIC 9(05).
           05 IDX-TRX-TIPO     PIC X(01).
           05 IDX-TRX-VALOR    PIC 9(09).
           05 IDX-TRX-DTPROC   PIC X(10).