       01 WS-REG-IDX-ERR.
           05 IDX-ERR-ID       PIC 9(05).
           05 IDX-ERR-CLI-ID   PIC 9(05).
           05 IDX-ERR-DESC     PIC X(80).
           05 IDX-ERR-DTOC     PIC X(10).