       01 WS-REG-TRANSACAO.
           05 WS-TRX-CLI-ID    PIC 9(05).
           05 WS-TRX-ID        PIC 9(05).
           05 WS-TRX-TIPO      PIC X(01).
           05 WS-TRX-VALOR     PIC 9(09).